tutorials/heatTransfer/heatSimpleFoam/ImpJet-AMS/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object controlDict;
 version 2.0;
}

application heatSimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 9;

deltaT 1e-05;

writeControl timeStep;

writeInterval 100000.0;

purgeWrite 0;

writeFormat ascii;

writePrecision 12;

writeCompression off;

timeFormat general;

timePrecision 12;

runTimeModifiable false;

