tutorials/heatTransfer/heatSimpleFoam/ImpJet-AMS/constant/RASProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object RASProperties;
 version 2.0;
}

RASModel LaunderSharmaYap;

turbulence on;

printCoeffs on;

