tutorials/heatTransfer/heatSimpleFoam/ImpJet-AMS/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object turbulenceProperties;
 version 2.0;
}

simulationType RASModel;

