tutorials/heatTransfer/heatSimpleFoam/ImpJet-AMS/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object fvSolution;
 version 2.0;
}

solvers
{
  T
  {
    maxIter 100;
    preconditioner DILU;
    relTol 0;
    solver PBiCG;
    tolerance 1e-08;
  }
  U
  {
    maxIter 100;
    preconditioner DILU;
    relTol 0;
    solver PBiCG;
    tolerance 1e-08;
  }
  p
  {
    maxIter 100;
    minIter 2;
    preconditioner DIC;
    relTol 0;
    solver PCG;
    tolerance 1e-12;
  }
  epsilon
  {
    maxIter 100;
    preconditioner DILU;
    relTol 0;
    solver PBiCG;
    tolerance 1e-08;
  }
  k
  {
    maxIter 100;
    preconditioner DILU;
    relTol 0;
    solver PBiCG;
    tolerance 1e-08;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell 0;
  pRefValue 0;
  residualControl
  {
    T 1e-05;
    U 1e-05;
  }
}

relaxationFactors
{
  equations
  {
    U 0.9;
    default 0.8;
    T 1.0;
  }
  fields
  {
    default 0.3;
    p 0.3;
  }
}

